app/controllers/feedbacks_controller.rb

SELECT `feedbacks`.* FROM `feedbacks`
---
  def index
    @feedbacks = Feedback.all

INSERT INTO `feedbacks` (`created_at`, `phone`, `price`, `updated_at`) VALUES ('2014-08-18 08:43:03', 'dsaffd', 0, '2014-08-18 08:43:03')
---
  def create
    @feedback = Feedback.new(feedback_params)

    respond_to do |format|
      if @feedback.save

UPDATE `feedbacks` SET `phone` = '13811269532', `updated_at` = '2014-08-18 08:47:17' WHERE `feedbacks`.`id` = 4
---
  def update
    respond_to do |format|
      if @feedback.update(feedback_params)

DELETE FROM `feedbacks` WHERE `feedbacks`.`id` = 9
---
  def destroy
    @feedback.destroy

SELECT  `feedbacks`.* FROM `feedbacks`  WHERE `feedbacks`.`id` = 12 LIMIT 1
---
    def set_feedback
      @feedback = Feedback.find(params[:id])